{
  "skills": [
    {
      "skillsHeading": "Technologie",
      "skillsGroup": [
        {
          "skillsTech": "HTML5",
          "skillsDesc": [
            {
              "techHeading": "Pug(Jade)",
              "techDesc": "Przyśpiesza moją pracę, pilnuje spójności kodu, pozwala zorganizować lepiej kod źródłowy."
            },
            {
              "techHeading": "Semantyka",
              "techDesc": "W projektach stosuję znaczniki HTML5, aby&nbsp;kod był bardziej czytelny i lepiej idenksowany przez przeglądarki."
            }
          ]
        },
        {
          "skillsTech": "CSS3",
          "skillsDesc": [
            {
              "techHeading": "Preprocesory",
              "techDesc": "Podczas tworzenia korzystam z preprocesorów takich jak Sass, SCSS, Less i Stylus. Preferuję czystą składnię z tego powodu najlepiej pisze mi się w Stylusie, w pozostałych preprocesorach czuje się równie swobodnie."
            },
            {
              "techHeading": "Metodologie",
              "techDesc": "Korzystam z metodologii BEM dla lepszego zarządzania kodem i lepszego skalowania architektury CSS."
            },
            {
              "techHeading": "Animacje",
              "techDesc": "Tworzenie animacji w CSS nie sprawia mi problemów, zyskałem doświadczenie w tworzeniu i w zarządzaniu kodem animacji."
            }
          ]
        },
        {
          "skillsTech": "JS",
          "skillsDesc": [
            {
              "techHeading": "Animacje",
              "techDesc": "Tworzenie animacji w JS przy użyciu bibliotek takich jak snap.svg, d3.js, bodymovin. Pozwalają na wygodniejsze ustawianie opóźnień dla animacji, dzięki kolejkowaniu w JS."
            },
            {
              "techHeading": "ES5",
              "techDesc": "Czuje się swobodnie w&nbsp;ES5, znajomość tej wersji standardu pozwala na&nbsp;pisanie kodu działającego w&nbsp;wielu popularnych przeglądarkach."
            },
            {
              "techHeading": "ES6",
              "techDesc": "Kolejna wersja standardu, która poprawia wiele rzeczy i dodaje więcej wbudowanych funkcji przyśpieszających pracę na&nbsp;kodzie."
            }
          ]
        },
        {
          "skillsTech": "Automatyzacja",
          "skillsDesc": [
            {
              "techHeading": "Gulp",
              "techDesc": "Dobrze zaznajomiłem się z&nbsp;Gulpem, na swoje potrzeby tworze dedykowane konfiguracje do projektów."
            },
            {
              "techHeading": "Webpack",
              "techDesc": "Konfiguracja środowiska pod&nbsp;ES6 z dodaniem loaderów np. ESLint."
            },
            {
              "techHeading": "Gulp + Webpack",
              "techDesc": "Połączenie środowisk pozwoliło mi na połączenie plusów jednego i drugiego rozwiązania, prostotę task-runnera i zaawansowaną technikę bundle'owania plików."
            }
          ]
        }
      ]
    },
    {
      "skillsHeading": "Miałem do czynienia",
      "skillsGroup": [
        {
          "skillsTech": "JS",
          "skillsDesc": [
            {
              "techHeading": "React",
              "techDesc": "Poznałem działanie i założenia biblioteki od Facebooka, wiem jakie korzyści i wady niesie jego użytkowanie."
            },
            {
              "techHeading": "Vue",
              "techDesc": "Lekka i przyjemna biblioteka do&nbsp;tworzenia warstwy widoku w&nbsp;aplikacji, używająca szablonów."
            },
            {
              "techHeading": "Mustache",
              "techDesc": "Zapoznałem się z działaniem Mustache.js, narzędziem o które się opiera znaczna ilość frameworków/bibliotek korzystających z&nbsp;szablonów."
            },
            {
              "techHeading": "Grunt",
              "techDesc": "Pierwszy taskrunner jaki poznałem wraz z generatorem Yeoman."
            }
          ]
        },
        {
          "skillsTech": "PHP",
          "skillsDesc": [
            {
              "techHeading": "Magento 1.x",
              "techDesc": "Stworzenie struktury pod Magento i wdrożenie jej, podstawowa funkcjonalność."
            },
            {
              "techHeading": "Contao 3.x",
              "techDesc": "Zaznajomienie się ze strukturą i&nbsp;panel adminem."
            },
            {
              "techHeading": "Wordpress",
              "techDesc": "Znajomość panelu admina, lokalizacji plików."
            },
            {
              "techHeading": "Twig",
              "techDesc": "Współpraca ze wzorcem Twig podczas poznawania Symfony 2."
            }
          ]
        },
        {
          "skillsTech": "Pozostałe",
          "skillsDesc": [
            {
              "techHeading": "SQL",
              "techDesc": "Tworzenie prostych zapytań do&nbsp;bazy SQL z poziomu kodu PHP i terminala."
            },
            {
              "techHeading": "Markdown",
              "techDesc": "Poznałem go podczas tworzenia treści na mediawiki i&nbsp;dokumentacji na github.com."
            }
          ]
        }
      ]
    }
  ]
}